app/controllers/api/v1/sessions_controller.rb

  def create
    user = User.find_by(email: params[:user_login])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test5@test.com"], ["LIMIT", 1]]