app/controllers/api/v1/shifts_controller.rb

SELECT "shifts".* FROM "shifts"
---
  def index
    @shifts = Shift.all

INSERT INTO "shifts" ("title", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["title", "tet5@test.com"], ["created_at", "2018-12-12 15:40:53.113998"], ["updated_at", "2018-12-12 15:40:53.113998"], ["user_id", 1]]
---
  def create
    @shift = Shift.new(shift_params)
    @shift.save!

SELECT  "shifts".* FROM "shifts" WHERE "shifts"."id" = ? ORDER BY "shifts"."id" ASC LIMIT ?  [["id", 0], ["LIMIT", 1]]
DELETE FROM "shifts" WHERE "shifts"."id" = ?  [["id", 1]]
---
  def destroy
    @shift = Shift.find(params[:id])

    if @shift.destroy